import { RiArrowDropDownLine } from "react-icons/ri";
import DropDown from "./DropDown";
const CommonQuestion = () => {
  const data = [
    {
      id: 0,
      question: "بهترین منطقه ونکوور کجاست؟",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است. طراح گرافیک از این متن به‌عنوان عنصری از ترکیب‌بندی برای پر کردن صفحه و ارائه اولیه استفاده می‌کند. محتوای این متن می‌تواند در آینده جایگزین شود و به‌عنوان یک الگو در نظر گرفته شود.",
    },
    {
      id: 1,
      question: "قسط ماهیانه چقدر است ؟",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است. طراح گرافیک از این متن به‌عنوان عنصری از ترکیب‌بندی برای پر کردن صفحه و ارائه اولیه استفاده می‌کند. محتوای این متن می‌تواند در آینده جایگزین شود و به‌عنوان یک الگو در نظر گرفته شود.",
    },
    {
      id: 2,
      question: "خرید یا پیش خرید ؟",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است. طراح گرافیک از این متن به‌عنوان عنصری از ترکیب‌بندی برای پر کردن صفحه و ارائه اولیه استفاده می‌کند. محتوای این متن می‌تواند در آینده جایگزین شود و به‌عنوان یک الگو در نظر گرفته شود.",
    },
    {
      id: 3,
      question: "بهترین زمان برای خرید ؟",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است. طراح گرافیک از این متن به‌عنوان عنصری از ترکیب‌بندی برای پر کردن صفحه و ارائه اولیه استفاده می‌کند. محتوای این متن می‌تواند در آینده جایگزین شود و به‌عنوان یک الگو در نظر گرفته شود.",
    },
    {
      id: 4,
      question: "چقدر وام می تونم بگیرم ؟",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است. طراح گرافیک از این متن به‌عنوان عنصری از ترکیب‌بندی برای پر کردن صفحه و ارائه اولیه استفاده می‌کند. محتوای این متن می‌تواند در آینده جایگزین شود و به‌عنوان یک الگو در نظر گرفته شود.",
    },
    {
      id: 5,
      question: "هاوس یا آپارتمان ؟",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ است. طراح گرافیک از این متن به‌عنوان عنصری از ترکیب‌بندی برای پر کردن صفحه و ارائه اولیه استفاده می‌کند. محتوای این متن می‌تواند در آینده جایگزین شود و به‌عنوان یک الگو در نظر گرفته شود.",
    },
  ];
  return (
    <div className="px-8 w-full py-5 flex flex-col justify-start items-center gap-5">
      <h4>سوالات متداول شما</h4>
      {data.map((item, index) => (
        <DropDown item={item} key={index} />
      ))}
    </div>
  );
};

export default CommonQuestion;
